---
kind: type
id: T:Autodesk.Revit.UI.TextEditorOptions
source: html/a3511a5d-4611-f21e-1dc5-2196b52c4071.htm
---
# Autodesk.Revit.UI.TextEditorOptions

Provides access to settings that control Revit's Text Editor appearance and functionality.

## Syntax (C#)
```csharp
public class TextEditorOptions : IDisposable
```

## Remarks
These settings are stored in the Revit.ini file. All documents in Revit instances which use this Revit.ini will follow these settings.